pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/heatTransferPeriodicBox/0.heat/R.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "2.74";
    object      R.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<tensor> 
256
(
(8.80909e-05 -1.29297e-08 5.34282e-05 -1.29297e-08 0.000160836 5.39996e-05 5.34282e-05 5.39996e-05 0.0355517)
(0.000215124 -1.22757e-07 0.000111504 -1.22757e-07 8.38484e-05 2.11668e-05 0.000111504 2.11668e-05 0.172198)
(3.42493e-05 2.50745e-07 6.71506e-05 2.50745e-07 0.000153186 0.00010654 6.71506e-05 0.00010654 0.0528238)
(0.000175514 2.64832e-06 5.53227e-05 2.64832e-06 9.63043e-05 1.10072e-05 5.53227e-05 1.10072e-05 0.00612772)
(0.00160754 5.92839e-06 7.07296e-05 5.92839e-06 0.00517064 0.000108908 7.07296e-05 0.000108908 0.00260692)
(0.000218254 3.49787e-07 0.000113394 3.49787e-07 0.000296808 7.65912e-05 0.000113394 7.65912e-05 0.060906)
(0.000191422 7.25238e-06 3.892e-05 7.25238e-06 0.00176632 4.4739e-05 3.892e-05 4.4739e-05 0.000710229)
(0.000538227 4.84857e-06 -8.3708e-05 4.84857e-06 0.00185296 -0.000215459 -8.3708e-05 -0.000215459 0.00897386)
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    lr1
    {
        type            cyclic;
    }
    lr2
    {
        type            cyclic;
    }
    vh1
    {
        type            cyclic;
    }
    vh2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
