pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/heatTransferPeriodicBox/0.heat/R.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "2.74";
    object      R.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<tensor> 
256
(
(5.15637e-05 -1.38699e-07 8.78258e-06 -1.38699e-07 5.81523e-05 -9.57116e-06 8.78258e-06 -9.57116e-06 0.0118351)
(5.48829e-05 -1.32709e-08 4.5534e-07 -1.32709e-08 2.00475e-06 1.01887e-07 4.5534e-07 1.01887e-07 0.0182742)
(4.37931e-05 1.33071e-07 -3.02012e-06 1.33071e-07 0.000131581 -1.69734e-06 -3.02012e-06 -1.69734e-06 0.0140306)
(0.000162447 5.70576e-07 -6.8244e-06 5.70576e-07 0.000117857 -1.41898e-05 -6.8244e-06 -1.41898e-05 0.00433009)
(0.000519923 -3.13819e-06 -4.19665e-05 -3.13819e-06 0.00236306 -0.000100294 -4.19665e-05 -0.000100294 0.00231348)
(9.05691e-05 1.09307e-08 -1.3512e-05 1.09307e-08 0.000191443 -2.27521e-06 -1.3512e-05 -2.27521e-06 0.0130902)
(9.7321e-05 9.23979e-08 -4.72191e-06 9.23979e-08 0.000704787 -5.7109e-05 -4.72191e-06 -5.7109e-05 0.00126961)
(0.000191596 -1.2789e-06 -1.24366e-05 -1.2789e-06 0.00121104 -8.28614e-05 -1.24366e-05 -8.28614e-05 0.00447107)
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    lr1
    {
        type            cyclic;
    }
    lr2
    {
        type            cyclic;
    }
    vh1
    {
        type            cyclic;
    }
    vh2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
