pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/heatTransferPeriodicBox/0.heat/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "2.74";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
256
(
(0.011905 0.0502836 0.00492679)
(0.0364123 0.0680179 0.273858)
(-0.00957934 0.0307429 0.0436873)
(-0.0283466 0.0198623 -0.0172706)
(0.0190096 -0.00520277 -0.014596)
(0.0125513 -0.00240324 0.056007)
(-0.0290682 -0.00614603 -0.0151005)
(-0.0295017 -0.0107054 0.0284005)
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    lr1
    {
        type            cyclic;
    }
    lr2
    {
        type            cyclic;
    }
    vh1
    {
        type            cyclic;
    }
    vh2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
