pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/heatTransferPeriodicBox/0.heat/U.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "2.74";
    object      U.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
256
(
(0.00400624 0.0293513 -0.224995)
(0.0220124 0.038079 -0.305819)
(-0.00757607 0.0315213 -0.226123)
(-0.0212907 0.0266595 -0.172265)
(0.00838074 -0.0113424 -0.153188)
(0.00593765 -0.00389185 -0.214319)
(-0.0171942 -0.00660734 -0.147826)
(-0.0218946 -0.00136766 -0.0632458)
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    lr1
    {
        type            cyclic;
    }
    lr2
    {
        type            cyclic;
    }
    vh1
    {
        type            cyclic;
    }
    vh2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
