pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/heatTransferPeriodicBox/0.heat/U.particlesMean
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "2.74";
    object      U.particlesMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
256
(
(-0.000917254 -0.000552745 -0.0854338)
(0.00118756 -0.00167327 -0.0976163)
(-0.00194869 -0.00193697 -0.108805)
(-0.00398732 -0.00328617 -0.0847169)
(-0.00167513 0.000477913 -0.104107)
(-0.00254612 -0.00293829 -0.0940511)
(-0.00170581 -0.00299225 -0.0636352)
(-0.00178641 -0.00131817 -0.0794204)
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    lr1
    {
        type            cyclic;
    }
    lr2
    {
        type            cyclic;
    }
    vh1
    {
        type            cyclic;
    }
    vh2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
