pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/heatTransferPeriodicBox/0.heat/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "2.74";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
624
(
9.645e-08
7.85687e-08
4.05335e-07
1.02387e-07
9.12897e-08
1.93042e-06
-1.45595e-07
3.53581e-08
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
        value           nonuniform List<scalar> 
16
(
-3.75295e-07
-1.42492e-07
-1.12704e-07
-9.95586e-07
-1.71121e-06
-3.09954e-07
-1.49716e-06
-2.49757e-06
-3.17324e-07
6.21183e-08
-2.10838e-07
-8.72352e-07
-4.1173e-07
-4.29459e-07
-7.6313e-07
-6.30574e-07
)
;
    }
    top
    {
        type            cyclic;
        value           nonuniform List<scalar> 
16
(
3.75295e-07
1.42492e-07
1.12704e-07
9.95586e-07
1.71121e-06
3.09954e-07
1.49716e-06
2.49757e-06
3.17324e-07
-6.21183e-08
2.10838e-07
8.72352e-07
4.1173e-07
4.29459e-07
7.6313e-07
6.30574e-07
)
;
    }
    lr1
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
8.44455e-09
-3.01516e-08
9.0842e-09
1.49056e-07
-1.65708e-08
-8.94998e-09
-3.09252e-08
-2.98644e-09
...
)
;
    }
    lr2
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
-8.44455e-09
3.01516e-08
-9.0842e-09
-1.49056e-07
1.65708e-08
8.94998e-09
3.09252e-08
2.98644e-09
...
)
;
    }
    vh1
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
-2.13505e-07
-1.79427e-07
1.05153e-08
5.74298e-08
1.74002e-08
-2.46694e-08
-1.07969e-07
-1.01363e-08
...
)
;
    }
    vh2
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
2.13505e-07
1.79427e-07
-1.05153e-08
-5.74298e-08
-1.74002e-08
2.46694e-08
1.07969e-07
1.01363e-08
...
)
;
    }
}


// ************************************************************************* //
