pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/heatTransferPeriodicBox/0.heat/phi.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "2.74";
    object      phi.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
624
(
1.00872e-07
8.36165e-08
5.1917e-07
1.09117e-07
9.39716e-08
2.09795e-06
-1.54872e-07
3.38643e-08
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
        value           nonuniform List<scalar> 
16
(
-4.94916e-07
-2.08804e-07
-1.85879e-07
-1.09485e-06
-1.91873e-06
-4.54532e-07
-1.70857e-06
-2.68931e-06
-4.5411e-07
9.61458e-09
-2.78446e-07
-1.01852e-06
-4.89032e-07
-4.86637e-07
-8.10244e-07
-6.98417e-07
)
;
    }
    top
    {
        type            cyclic;
        value           nonuniform List<scalar> 
16
(
4.94916e-07
2.08804e-07
1.85879e-07
1.09485e-06
1.91873e-06
4.54532e-07
1.70857e-06
2.68931e-06
4.5411e-07
-9.61458e-09
2.78446e-07
1.01852e-06
4.89032e-07
4.86637e-07
8.10244e-07
6.98417e-07
)
;
    }
    lr1
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
5.59072e-09
-3.61843e-08
7.40468e-09
1.57805e-07
-1.92559e-08
-1.0401e-08
-3.46016e-08
-2.36029e-09
...
)
;
    }
    lr2
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
-5.59072e-09
3.61843e-08
-7.40468e-09
-1.57805e-07
1.92559e-08
1.0401e-08
3.46016e-08
2.36029e-09
...
)
;
    }
    vh1
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
-2.26729e-07
-1.87729e-07
1.43873e-08
6.41158e-08
2.17755e-08
-2.50696e-08
-1.1968e-07
-1.78491e-08
...
)
;
    }
    vh2
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
2.26729e-07
1.87729e-07
-1.43873e-08
-6.41158e-08
-2.17755e-08
2.50696e-08
1.1968e-07
1.78491e-08
...
)
;
    }
}


// ************************************************************************* //
