pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/heatTransferPeriodicBox/0.heat/phi.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "2.74";
    object      phi.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
624
(
5.30095e-08
3.58757e-08
-5.4861e-07
3.28143e-08
6.61861e-08
-1.81557e-07
-6.50816e-08
4.94586e-08
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
        value           nonuniform List<scalar> 
16
(
5.21482e-07
4.36112e-07
4.82533e-07
7.8045e-08
4.88642e-07
7.21914e-07
5.3924e-07
-3.66936e-07
7.0832e-07
5.5841e-07
4.28573e-07
6.84745e-07
2.51493e-07
4.64802e-08
-3.05562e-07
1.64078e-07
)
;
    }
    top
    {
        type            cyclic;
        value           nonuniform List<scalar> 
16
(
-5.21482e-07
-4.36112e-07
-4.82533e-07
-7.8045e-08
-4.88642e-07
-7.21914e-07
-5.3924e-07
3.66936e-07
-7.0832e-07
-5.5841e-07
-4.28573e-07
-6.84745e-07
-2.51493e-07
-4.64802e-08
3.05562e-07
-1.64078e-07
)
;
    }
    lr1
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
3.2139e-08
2.13674e-08
2.40612e-08
4.12295e-08
5.37559e-09
3.13783e-09
3.08603e-09
-1.03474e-08
...
)
;
    }
    lr2
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
-3.2139e-08
-2.13674e-08
-2.40612e-08
-4.12295e-08
-5.37559e-09
-3.13783e-09
-3.08603e-09
1.03474e-08
...
)
;
    }
    vh1
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
-8.42023e-08
-9.30826e-08
-3.52909e-08
-2.42126e-08
-2.32444e-08
-2.15949e-08
-2.97589e-08
3.42743e-08
...
)
;
    }
    vh2
    {
        type            cyclic;
        value           nonuniform List<scalar> 
64
(
8.42023e-08
9.30826e-08
3.52909e-08
2.42126e-08
2.32444e-08
2.15949e-08
2.97589e-08
-3.42743e-08
...
)
;
    }
}


// ************************************************************************* //
