pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/heatTransferPeriodicBox/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 0.95
    volScalarFieldValue alpha.particles 0.05
);

regions
(
/*
    boxToCell
    {
        box ( -0.08 -0.03 0) ( 0.08 0.03 0.5025 );
        fieldValues
        (
            volScalarFieldValue alpha.air 0.45
            volScalarFieldValue alpha.particles 0.55
        );
    }
    boxToCell
    {
        box ( -0.08 -0.03 0 ) ( -0.065 0.03 0.1 );
        fieldValues
        (
            volScalarFieldValue alpha.air 0.7
            volScalarFieldValue alpha.particles 0.3
        );
    }
    boxToCell
    {
        box ( -0.08 -0.03 0.1 ) ( -0.05 0.03 0.13 );
        fieldValues
        (
            volScalarFieldValue alpha.air 0.7
            volScalarFieldValue alpha.particles 0.3
        );
    }
*/
);


// ************************************************************************* //
